pragma Singleton
pragma ComponentBehavior: Bound

import Quickshell

Singleton {
    id: root

    property var timesTable: [
        " ⚬ ⚬ ⚬ ⚬", // 0
        " ⚬ ⚬ ⚬ ⤓", // 1
        " ⚬ ⚬ ⚬ ⥥", // 2
        " ⚬ ⚬ ⚬ ⟒", // 3
        " ⚬ ⚬ ⤓ ⟒", // 4
        " ⚬ ⚬ ⥥ ⟒", // 5
        " ⚬ ⚬ ⟒ ⟒", // 6
        " ⚬ ⤓ ⟒ ⟒", // 7
        " ⚬ ⥥ ⟒ ⟒", // 8
        " ⚬ ⟒ ⟒ ⟒", // 9
        " ⤓ ⟒ ⟒ ⟒", // 10
        " ⥥ ⟒ ⟒ ⟒", // 11
        " ⟒ ⟒ ⟒ ⟒", // 12
        " ⟒ ⟒ ⟒ ⥥", // 13
        " ⟒ ⟒ ⟒ ⤓", // 14
        " ⟒ ⟒ ⟒ ⚬", // 15
        " ⟒ ⟒ ⥥ ⚬", // 16
        " ⟒ ⟒ ⤓ ⚬", // 17
        " ⟒ ⟒ ⚬ ⚬", // 18
        " ⟒ ⥥ ⚬ ⚬", // 19
        " ⟒ ⤓ ⚬ ⚬", // 20
        " ⟒ ⚬ ⚬ ⚬", // 21
        " ⥥ ⚬ ⚬ ⚬", // 22
        " ⤓ ⚬ ⚬ ⚬", // 23
        ]
        property var minutesTable: [
        "⚬ ⚬ ⚬ ⚬", // 0
        "⤓ ⚬ ⚬ ⚬", // 5
        "⥥ ⚬ ⚬ ⚬", // 10
        "⟒ ⚬ ⚬ ⚬", // 15
        "⟒ ⤓ ⚬ ⚬", // 20
        "⟒ ⥥ ⚬ ⚬", // 25
        "⟒ ⟒ ⚬ ⚬", // 30
        "⟒ ⟒ ⤓ ⚬", // 35
        "⟒ ⟒ ⥥ ⚬", // 40
        "⟒ ⟒ ⟒ ⚬", // 45
        "⟒ ⟒ ⟒ ⤓", // 50
        "⟒ ⟒ ⟒ ⥥", // 55
        ]

        property var secondsTable: [
            "♦",
            "♢",
        ]
    function getTime(t) {
        var minutes = t.getMinutes();
        var hours = t.getHours();
        var seconds = t.getSeconds();
        var t = "";

        t += timesTable[hours % 24 ];

        t += `🮇${secondsTable[seconds % 2]}▎`;
        t += minutesTable[Math.floor(minutes / 5)];

        return t;
    }
}
